In [1]:
import warnings
warnings.simplefilter('ignore')

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import pickle
#to save the pkl file

In [5]:
df=pd.read_csv("hiring.csv")
df.head()

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000

In [7]:
df.isna().sum()

experience         2
test_score         1
interview_score    0
salary             0
dtype: int64

In [8]:
df["experience"].fillna(0,inplace=True)

In [10]:
df['test_score'].fillna(df['test_score'].mean(),inplace=True)

In [11]:
df

  experience  test_score  interview_score  salary
0          0    8.000000                9   50000
1          0    8.000000                6   45000
2       five    6.000000                7   60000
3        two   10.000000               10   65000
4      seven    9.000000                6   70000
5      three    7.000000               10   62000
6        ten    7.857143                7   72000
7     eleven    7.000000                8   80000

___Data is Cleaned___

In [21]:
X = df.iloc[:,:-1]
X

  experience  test_score  interview_score
0          0    8.000000                9
1          0    8.000000                6
2       five    6.000000                7
3        two   10.000000               10
4      seven    9.000000                6
5      three    7.000000               10
6        ten    7.857143                7
7     eleven    7.000000                8

In [22]:
y=df.iloc[:,-1]
y

0    50000
1    45000
2    60000
3    65000
4    70000
5    62000
6    72000
7    80000
Name: salary, dtype: int64

In [23]:
X.experience

0         0
1         0
2      five
3       two
4     seven
5     three
6       ten
7    eleven
Name: experience, dtype: object

In [40]:
#text to int
def conv(x):
    dict = {'two':2, 'three':3, 'five':5, 'seven':7, 'ten':10, 0:0, 'eleven':11 }
    return dict[x]

In [44]:
X['experience']=X['experience'].apply(lambda x: conv(x) )

In [46]:
X.head()

   experience  test_score  interview_score
0           0         8.0                9
1           0         8.0                6
2           5         6.0                7
3           2        10.0               10
4           7         9.0                6

In [47]:
X.dtypes

experience           int64
test_score         float64
interview_score      int64
dtype: object

In [48]:
# as dataset is small, directly making model

from sklearn.linear_model import LinearRegression
lr=LinearRegression()

In [49]:
#fitting

lr.fit(X,y)

LinearRegression()

In [51]:
#Prediction

y_pred=lr.predict(X)
print(y_pred)

[52313.61238494 45722.68644263 58231.95591138 63991.7318464
 67429.06277517 61080.55179794 75922.72532666 79307.67351488]

In [52]:
y

0    50000
1    45000
2    60000
3    65000
4    70000
5    62000
6    72000
7    80000
Name: salary, dtype: int64

In [53]:
from sklearn.metrics import r2_score
r2_score(y_pred,y)

0.9626511210293307

In [55]:
lr.predict([[2,5,10]])

array([54427.04169373])

# MODEL DEPLOYMENT

In [57]:
import pickle
pickle.dump(lr,open('model.pkl','wb'))  #saved in pkl in HDD

In [58]:
# read it from the system and predicting it

model2=pickle.load(open('model.pkl','rb'))

In [59]:
model2.predict([[5,5,10]]) #passing random values not from data

array([62909.94382316])